Revit 2027 API
BuiltInFailures.SketchFailures.CannotChangeWorkplaneVisibility Property
 Can't change Work Plane Visibility.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotChangeWorkplaneVisibility { get; }
Public Shared ReadOnly Property CannotChangeWorkplaneVisibility As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotChangeWorkplaneVisibility {
	FailureDefinitionId^ get ();
}
static member CannotChangeWorkplaneVisibility : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace